number = int(input())

for num in range(number + 1):
    if num % 2 == 0:
        print(2 ** num)

# Тази задача има не ясно написано условие.
# "Да се напише програма, която чете число n,
# въведено от потребителя, и печата четните степени на 2 ≤ 2n: 20, 22, 24, 26, …, 2n. "
# Нищо не се разбира от тук натам: ... и печата четните степени на 2 ≤ 2n: 20, 22, 24, 26, …, 2n.
# според мен трябва да е така: от или във диапазона на числото n което прочитате от конзолата,
# намерете и извадете само четните цифри.След това ги повдигнете на степен 2,тоест повдигнете ги на втора степен.
# И отпечатайте резултата.
# четни степени на 2!? тоест да извадиш всички цифри от диапазона,които са четни,
# демек цифрите които се делят на 2 ез остатък.