number = int(input()) #това е променливата за прочитане/получаване на данни с които да работим.
# тази променлива съдържа числото което указва колко пъти цикъла ще се изпълни,тоест колко на брой итерации ще направим със цикъла.
# ако числото е 100,тогава цикъла ще се повтори 100 пъти,ако е 2,тогава ще се повтори 2 пъти.

# num в цикъла е нова променлива която няма общо с променливата за прочитане на данни горе с име number.
# Тази променлива num е необходима,за да има къде да се помни резултата от всяка итерация в цикъла и след това да се ползва отново или принтира.

number = int(input())
for num in range(1, number + 1, 3):
    print(num)